; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	image0 - mode
	spectrograph1 - mode
	Star3 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Star6 - direction
	Star2 - direction
	Star5 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 spectrograph1)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet9)
	(supports instrument3 image0)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star6)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument5 spectrograph1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star2)
	(supports instrument6 image0)
	(supports instrument6 spectrograph1)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star13)
	(supports instrument7 spectrograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation4)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
	(supports instrument8 spectrograph1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star5)
	(calibration_target instrument8 Star6)
	(supports instrument9 image0)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star5)
	(calibration_target instrument9 Star2)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation4)
)
(:goal (and
	(pointing satellite0 Phenomenon11)
	(pointing satellite2 Star6)
	(have_image Planet7 image0)
	(have_image Phenomenon8 spectrograph1)
	(have_image Planet9 image0)
	(have_image Planet10 image0)
	(have_image Phenomenon11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Star14 image0)
	(have_image Planet15 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 11
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 11
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 11
4. (turn_to satellite0 planet7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet7)
   goals met: 0 of 11
5. (take_image satellite0 planet7 instrument0 image0)
   added: (have_image planet7 image0)
   goals met: 1 of 11
6. (turn_to satellite0 planet15 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 planet15)
   goals met: 1 of 11
7. (take_image satellite0 planet15 instrument0 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 2 of 11
8. (turn_to satellite0 planet10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet10)
   goals met: 2 of 11
9. (take_image satellite0 planet10 instrument0 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 11
10. (turn_to satellite0 phenomenon8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 11
11. (take_image satellite0 phenomenon8 instrument0 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 4 of 11
12. (turn_to satellite0 phenomenon12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon12)
   goals met: 4 of 11
13. (take_image satellite0 phenomenon12 instrument0 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 5 of 11
14. (turn_to satellite0 planet9 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet9)
   goals met: 5 of 11
15. (take_image satellite0 planet9 instrument0 image0)
   added: (have_image planet9 image0)
   goals met: 6 of 11
16. (turn_to satellite0 star13 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star13)
   goals met: 6 of 11
17. (take_image satellite0 star13 instrument0 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 7 of 11
18. (turn_to satellite0 star14 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star14)
   goals met: 7 of 11
19. (take_image satellite0 star14 instrument0 image0)
   added: (have_image star14 image0)
   goals met: 8 of 11
20. (turn_to satellite0 phenomenon11 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 phenomenon11)
   goals met: 9 of 11
21. (take_image satellite0 phenomenon11 instrument0 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 10 of 11
22. (turn_to satellite2 star6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star6)
   goals met: 11 of 11
